{"public_identifier":"andybosnak","profile_pic_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/person/andybosnak/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241002%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241002T190549Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=82b107282b9e11bf6af7d2a943e715a2242cf93fcdbc95190fe418d3be4133a6","background_cover_image_url":null,"first_name":"Andy","last_name":"Bosnak","full_name":"Andy Bosnak","follower_count":null,"occupation":"Podcast Sound Designer, Editor & Mixing Engineer at Association of the United States Army - AUSA","headline":"Podcast Audio Editor at EMRAP INC., Mixer, Sound & Film Collaborator.","summary":"Storytelling and meaningful messages in podcasts, film, and music are my passion.\nMixing sound is my craft that I have used for making these messages clear and engaging. \nOpen-minded problem solver, and big picture thinker, bringing encouragement, strategy, and support to teams, valuing each individual contribution. \nA calm, dependable professional who devotes every effort to achieve the best results. \nThoughtful, conscientious collaborator, active listener with patient, yet assertive approach to work.\n\nI offer more than 20 years of professional audio experience including Pro Tools, mixing, sound design, music, and project management.\nMy highly valued skills and expertise throughout my career include:\n- Mixing\n- Sound Design\n- Dialogue Editing\n- Post-Production Audio\n- Music Production\n- Project Management\n- Audio, Film & Music Collaboration\n- Project Scheduling\n- Studio Production\n- Curriculum Development\n- Lesson Planning & Presentation\n\nTo discuss new opportunities, please contact me directly: andybosnak@gmail.com","country":"US","country_full_name":"United States of America","city":"Greater Chicago Area","state":null,"experiences":[{"starts_at":{"day":1,"month":3,"year":2022},"ends_at":null,"company":"Association of the United States Army - AUSA","company_linkedin_profile_url":"https://www.linkedin.com/company/ausaorg/","company_facebook_profile_url":null,"title":"Podcast Sound Designer, Editor & Mixing Engineer","description":"Dialogue editing, mixing, mastering with Pro Tools & Izotope.\nSound Design, music supervisor.","location":null,"logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/ausaorg/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241002%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241002T190549Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=f439e35e19efa0faf1f024ab593c5676c5a2c2ece35612d36940bffcea0439ac"},{"starts_at":{"day":1,"month":7,"year":2021},"ends_at":null,"company":"Pod People","company_linkedin_profile_url":"https://www.linkedin.com/company/pod-people/","company_facebook_profile_url":null,"title":"Podcast Mastering Engineer","description":"Mix & Master to loudness specifications in Pro Tools & Izotope using limiters and loudness meters.\nFine dialogue editing & repair using Izotope De-Click, De-Noise, De-Plosive, Spectral Repair & Ambience Match.\nhttps://www.podpeople.com/\nWorked on:\n“Biscuits & Jam” from Southern Living; nominee for best lifestyle pod at 2022 Publisher Podcast Awards.\n“Homemade” from All Recipes; more than a million downloads \n“Ladies First with Laura Brown” from In Style magazine\n\"The Internal Podcast for People Who Make Podcasts\" by Pod People\n“Brick & Order” from Faire\n“In Vogue: the 2000’s” from Vogue\n\"The Important Part: Investing with Liz Young\" from SoFi","location":"Greater Chicago Area","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/pod-people/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241002%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241002T190549Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=aeaa535492832d2c74d57908b171b2fcef4d33978d871028bc7f48caeb10ef0a"},{"starts_at":{"day":1,"month":3,"year":2018},"ends_at":null,"company":"Freelance Media   ","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Podcast Audio Editor & Mixer","description":"•Story and audio editor for Sonos Radio’s Things That Stuck with Ludwig Goransson.\n• Mixing & Mastering engineer for Black Mountain Radio, season 2 audio documentaries.\nhttps://podcasts.apple.com/us/podcast/of-consequence-to-the-signified/id1535734852?i=1000549427295\n•Adaptable to different workflows and templates.\n•Using Izotope RX Leveler, Spectral Repair, De-Click, Voice De-Noise, Ambience Match for detailed dialogue editing, consistent room tone, and minimal breaths.\n•Extensive use of FabFilter, UAD, Waves, Slate, Valhalla, Digidesign, and more plug-ins.\n•Leverage music and film experience for audio storytelling.","location":"Chicago, Illinois, United States","logo_url":null},{"starts_at":{"day":1,"month":2,"year":2021},"ends_at":null,"company":"Shape of the World","company_linkedin_profile_url":"https://www.linkedin.com/company/shape-of-the-world/","company_facebook_profile_url":null,"title":"Podcast Audio Producer ","description":"http://shapeoftheworldshow.com/\n•Record local interviews, hire tape sync & plan Riverside.fm remote recordings.\n•Mix dialogue, music, and sound effects in Pro Tools and Master to loudness specifications using Izotope.\n•Compose original music, hire composers, select & edit music.\n•Dialogue and story editing, sound design.","location":"Chicago, Illinois, United States","logo_url":"https://media-exp1.licdn.com/dms/image/C560BAQFGYPpsFf0NXg/company-logo_400_400/0/1536862819348?e=1664409600&v=beta&t=olEBCcThBIcE5ier4FvAKUKAYlbkD-y1s_wN_ze7Ic8"},{"starts_at":{"day":1,"month":1,"year":2001},"ends_at":null,"company":"Boz Music","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Producer, Recording Engineer","description":"•Engineer for blue-chip clients: McDonald’s, Disney, Allstate, US Army, and Mattell; many sessions including Chicago Symphony Orchestra. \n•Extensive work with notable producers: Brian Deck (Iron & Wine, Modest Mouse), Keith Cleversley (Flaming Lips, Hum), Tim Rutili (Califone, Red Red Meat), and Bob Ezrin (Pink Floyd, Alice Cooper).\n•Served as recording engineer for John Cale’s (Velvet Underground) “Hobo Sapiens” record and Flickerstick’s album “Tarantula” on Idol Records. \n•Included in several editions of “Local Corner Chicago” engineers in Mix magazine.\n•Wrote songs & toured nationally as a guitarist for Beak and The Timeout Drawer. Shared billing with: Killing Joke, Pentagram, Anvil, The Sword, Om, Explosions in the Sky, and Jucifer. \n•Worked at studios: Narwhal, Hypercube, Coda Room, Engine, Playground, Studio Chicago, Clava, and Minbal. \n\n* Recruit clients, record, mix, and produce music, record music for advertisements, as well\nas recording narration.","location":"Greater Chicago Area","logo_url":null},{"starts_at":{"day":1,"month":6,"year":2020},"ends_at":{"day":30,"month":4,"year":2022},"company":"EMRAP INC.","company_linkedin_profile_url":"https://www.linkedin.com/company/emrap-inc./","company_facebook_profile_url":null,"title":"Podcast Audio ","description":"https://www.emrap.org/\nDialogue edit and restoration to high level of detail.\nBreath removal and consistent room tone with Ambience Match.\nMix to proper loudness specifications using Pro Tools and Izotope RX. \nEditor for RN Edition, Snack, and PA Edition podcasts. \n\nLeading emergency medicine educational podcasts.","location":"Greater Chicago Area","logo_url":"https://media-exp1.licdn.com/dms/image/C560BAQEKss4sS2cHnA/company-logo_400_400/0/1574118948177?e=1664409600&v=beta&t=NOk_XAW8yP0bU-bg0eEYGOkZCPjEF9VTtzjIK2iV4jc"},{"starts_at":{"day":1,"month":6,"year":2006},"ends_at":{"day":31,"month":7,"year":2021},"company":"Freelance Audio and Video Professional","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"FILM PRODUCTION & POST-PRODUCTION AUDIO  ","description":"•Recording engineer, mixer, and co-composer for original score of A&E American Justice: Facing Life: The Retrial of Evan Zimmerman.\n•Extensive narration production for McGraw-Hill, Harcourt, Ambrose, Someoddpilot, and Merrell.\n•Post-production sound for numerous film festival winners and official selections.\n•Work as assistant director, unit production manager, and producer on films.","location":"Greater Chicago Area","logo_url":null},{"starts_at":{"day":1,"month":10,"year":2013},"ends_at":{"day":31,"month":5,"year":2020},"company":"SAE Institute Chicago","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Audio Instructor","description":"Instructor in Audio Associate of Applied Science (AAS) degree. \n•\tImproved student interest and performance in post-production audio by showing examples of how technical workflows help with music, including creative music into post-production audio curriculum and increasing project time and decreasing lecture time.\n•\tHelped students access job opportunities and achieve employment success through working with career services to share personal industry connections, resulting in graduates attaining goal jobs. \n•\tChosen to create course content for 2 classes that were distributed nationally to other campuses, including highly effective experiential and student-driven learning activities. \n•\tCreated and presented content for final semester Music EP Capstone project, helping previously struggling / failing students pass the class and graduate through slowly, thoroughly, and patiently teaching all steps.\n•\tAchieved positive instructor evaluations consistently, being recognized for effectively engaging students during instruction, creating positive supportive learning environments, and stimulating student participation.","location":"Greater Chicago Area","logo_url":null},{"starts_at":{"day":1,"month":1,"year":2017},"ends_at":{"day":30,"month":4,"year":2020},"company":"Flashpoint Chicago","company_linkedin_profile_url":"https://www.linkedin.com/school/flashpoint-chicago/","company_facebook_profile_url":null,"title":"Instructor in Recording Arts and Film, Bachelor of Fine Arts (BFA) and Associate of Applied Science ","description":"•\tLed various discussions and workshops on producing, mapping steps to film completion, communication and safety on set, and scheduling and planning, effectively directing students toward completion of capstone film project.\n•\tAchieved high evaluation ratings in consistently being well-prepared and organized, clearly communicating expectations, motivating students, and successfully helping students gain skills and knowledge.","location":"Greater Chicago Area","logo_url":"https://media-exp1.licdn.com/dms/image/C4E0BAQFReabeamE9Yg/company-logo_400_400/0/1524755421619?e=1664409600&v=beta&t=vHaG_Huxu4V9bd9DSdosgYY79GsJ0382sXth5H3xpMM"},{"starts_at":{"day":1,"month":1,"year":2015},"ends_at":{"day":30,"month":6,"year":2016},"company":"DePaul University College of Computing and Digital Media","company_linkedin_profile_url":"https://www.linkedin.com/school/cdmdepaul/","company_facebook_profile_url":null,"title":"Graduate Teaching Assistant, Sound Supervisor, TV-381 Class/ Visiting Artist Series.","description":"Sound supervisor for TEDx DePaul University on April 29, 2016, \"What Must Be Done?\" \nServed as sound supervisor for episodes featuring respected film professionals such as David Webb & Janet People’s (Bladerunner), Adam Goldberg (The Goldbergs), Dan Harmon (Rick & Morty), and more.                                                                                                                                                                         \n•\tIdentified technical needs for proper levels and backups of audio recordings, environment problems, and gear solutions, creating workflow and technical documentation for shows. \n•\tTrained beginner students into talk show audio mix engineers, resulting in 1 student advancing to become replacement as professional sound supervisor through teaching signal flow and guiding through critical listening and best practices.","location":"Chicago, Illinois, United States","logo_url":"https://media-exp1.licdn.com/dms/image/C560BAQFAp3GnGPHU3A/company-logo_400_400/0/1654007202953?e=1664409600&v=beta&t=42lD6-P0eGlx_z9nvGkH43WpQzOpBMsVHsUqbmBrwcY"}],"education":[{"starts_at":null,"ends_at":null,"field_of_study":"Film/Video Production","degree_name":"Master's of Fine Arts (MFA), Cinema Directing. ","school":"DePaul University","school_linkedin_profile_url":"https://www.linkedin.com/school/depaul-university/","school_facebook_profile_url":null,"description":null,"logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/depaul-university/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241002%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241002T190549Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=6f2a6d0067bcf0280e9562e1a23e2c82213faac4a8b0ba094aa9c9fc40285d93","grade":null,"activities_and_societies":null},{"starts_at":null,"ends_at":null,"field_of_study":"Audio Recording","degree_name":"Associate of Arts (A.A.)","school":"Conservatory of Recording Arts and Sciences","school_linkedin_profile_url":"https://www.linkedin.com/school/conservatory-of-recording-arts-and-sciences/","school_facebook_profile_url":null,"description":null,"logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/conservatory-of-recording-arts-and-sciences/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241002%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241002T190549Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=915b58473232cf54da40a2d43d52c6b3ee7c2ae1b370d6d020170a226ff34415","grade":null,"activities_and_societies":null},{"starts_at":null,"ends_at":null,"field_of_study":"Liberal Arts and Sciences/Liberal Studies","degree_name":"Bachelor's degree","school":"Kansas State University","school_linkedin_profile_url":"https://www.linkedin.com/school/kansas-state-university/","school_facebook_profile_url":null,"description":null,"logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/kansas-state-university/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241002%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241002T190549Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=49e4dfb7eb0a7ec023ca48875e535cc2a4fc9a17725afef317f30f4d7e4a94f2","grade":null,"activities_and_societies":null}],"languages":[],"languages_and_proficiencies":[],"accomplishment_organisations":[],"accomplishment_publications":[],"accomplishment_honors_awards":[],"accomplishment_patents":[],"accomplishment_courses":[],"accomplishment_projects":[],"accomplishment_test_scores":[],"volunteer_work":[],"certifications":[{"starts_at":{"day":1,"month":2,"year":2021},"ends_at":null,"name":"Logic Pro X: Producing Music with Live Loops","license_number":null,"display_source":"linkedin.com","authority":"LinkedIn","url":"https://www.linkedin.com/learning/logic-pro-x-producing-music-with-live-loops?trk=flagship-lil_details_certification"},{"starts_at":{"day":1,"month":12,"year":2014},"ends_at":null,"name":"Avid Pro Tools Certified User","license_number":null,"display_source":null,"authority":"SAE Institute","url":null}],"connections":null,"people_also_viewed":[],"recommendations":["Bill Connor\n\n\n\nAndy is amazing to work with. He's very detail-oriented and is always looking for ways to make a project better. He communicates well, asks questions to make sure everyone is on the same page, and is great at taking feedback. He's always looking for ways to improve the sound quality of what he's working on, going above and beyond to make his deliverables are as good as they can be. He's got a great ear for dialogue and podcast editing and is skilled at mixing and mastering. He's a wonderful addition to any project or team.","Ilana Landsberg-Lewis (she/her)\n\n\n\nAndy jumped in to edit audio on my Podcast with great insight, skill, and attentiveness to detail. He is a terrific listener and collaborator, making his timely contributions all the more valuable and professionally executed. A real pleasure to work with!\"","Gina Fontanini\n\n\n\nAndy Bosnak is a leading and dedicated media artist, project manager, sound engineer, and educator. I worked with Andy Bosnak for nearly 4 years at Music Industry Workshop/Studio Chicago. His knowledge of sound recording, technical studio projects, and media production are unparalleled along with his leadership. Andy has a proven track record teaching and empowering others with thoroughness and patience specifically in the visual and sound sectors, having a specialized focus on technology.   Proving to be a professional collaborator, Andy is extremely open-minded and has demonstrated the skills to tackle issues with leadership, encouragement, and support to those he works with. I have seen Andy tackle technical as well as managerial obstacles with patience and efficiency, proving measurable progress. Working with him has taught me not only audio and visual technical skills but also inclusivity, patience, and the increasing value of pride in the workplace. Andy has always been a thoughtful team player with excellent technical capabilities in sound engineering, podcast recording, educational training, and audio management skills. Andy's personal empathy towards others makes him a great listener and educator. He collaboratively solves problems, works through issues, executes on deadlines, demonstrates the finest technical abilities, and leads by example.","Bill Baykan\n\n\n\nAndy is a terrific colleague and educator.  It was a pleasure working with him at Flashpoint College, where he taught both production and theory classes with equal facility.  Students benefited from his positive energy and understanding, as well as his subject matter expertise.  We look forward to working with Andy again soon.","Tim Yamaya\n\n\n\nI had the pleasure of working with Andy while teaching at the School of Audio Engineering in Chicago. We worked together to develop the curriculum for a new class. We had never worked together before, and were given short lead times to create content and have it ready for consumption.  Andy is great collaborator - his ability to both drive communications and actively listen to feedback made him a great partner to work with. His personality and technical expertise in audio enabled us to meet tight deadlines in a creative area where there were a lot of different ways that the final product could have taken shape. He also proved to be a genuine, natural teacher with the ability to connect to people across a diverse set of backgrounds. ","John Klein\n\n\n\nAndy and I have had the pleasure of going through DePaul's MFA program in the School of Cinematic Arts together, and we've also worked together on several short films now, in various capacities. Every time, without question, he's been such a phenomenal presence both on and off set, whether it's his work in post-production audio or even as an assistant director.  While I haven't seen him teach, I know his students appreciate the heck out of him, and his vast knowledge across all parts of the filmmaking process has served him well as both a professor and as a storyteller.  He's professional, easygoing yet organized and methodical, and his strong work ethic means that when Andy's around, stuff gets done, and done well.  Plus, he's just a good all-around dude, and I'm happy to call him both my collaborator and friend.  ","Chris Chapoy\n\n\n\nI was fortunate enough to have Andy as a professor and later on a co-worker. He is honest, hard working, determined, caring, humble and so much more. As an educator he motivated me to be better and always inspired me to work harder. As a co-worker he gave me countless opportunities as Andy wants others to succeed as he has. He has mentored me and helped me grow in both my professional and personal life. I hope to work again with Andy in the future but most importantly, I know that I have a genuine lifelong friend. ","James Auwarter\n\n\n\nI consider myself lucky to have worked alongside Andy since 2014. At that time, I personally was brand new to the teaching world. Without hesitation, Andy showed me the ropes, and he was instrumental in helping me develop into a good educator. This became a reoccurring theme; seeing him make a lasting impact on both colleagues, as well as students.\n\nAndy’s passions for teaching, music, audio, and film are apparent to anyone whom he meets. When it comes to audio post production questions, Andy remains at the top of my call-list. His dedication to this craft is inspiring, and his talent distinct.  I’ve often witnessed him bring a unique perspective to professional scenarios, while still always remaining the ultimate team-player. Andy is simply a great guy to work with and to be around: he’s smart, well-spoken, honest, and hard-working. Any time this guy calls, I pick up—and, that sums it up.","Geoffrey Smeltzer\n\n\n\nI've had the pleasure of working with Andy a few times over the past two years and I have always been impressed by his knowledge, preparedness, and conscientiousness. I saw those skills first hand as he has helped me complete my film projects as both an Audio Editor and as my First Assistant Director. Both jobs require a high level of collaboration and attention to detail.\n\nI was able to stay on task as a director on set because of Andy. He facilitated communications with all of the members of a 20 plus person film crew.  Everyone on set made it known that they felt heard and appreciated and that in my mind is thanks to Andy. Specifically I can think of one instance where there was an issue on set where a makeup artist was unwilling to listen to an actor's advice as to how to best handle her skin tone. Andy advised me on the best way to handle the conflict without anyone getting their feelings hurt or causing any further costly delay to our production. With his help we always managed to complete all of our shots even under a tight schedule.\nAs an Audio Editor has he always taken the initiative to ask questions and always completed his work on deadline. I found him to be very skilled and knowledgable in all aspects of Audio Editing and Post Production. Whenever I had questions for him during our time working in post-production audio Andy was always there to patiently answer my questions and help me grow to become a more well-rounded artist and Director.\n\nWhen I required extra help on a project Andy was able to call on a network of collaborators that were more than willing to work with me on his recommendation alone. I think that kind of trust and loyalty says a lot about how a person conducts themselves. ","Charles Mueller, MFA\n\n\n\nAndy was technically able and aesthetically engaged. As a producer writer and director I was always impressed with Andy’s understanding of both budget, time, and quality. An outstanding professional."],"activities":[],"similarly_named_profiles":[],"articles":[],"groups":[],"skills":[],"inferred_salary":null,"gender":"male","birth_date":null,"industry":null,"extra":null,"interests":[],"personal_emails":[],"personal_numbers":[]}