{"public_identifier":"jamieworoner","profile_pic_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/person/jamieworoner/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233345Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=7507cdba7001819ce7661dc748b9ac09e046161f54d7a7e334519a8995117107","background_cover_image_url":null,"first_name":"Jamie","last_name":"Woroner","full_name":"Jamie Woroner","follower_count":1381,"occupation":"Enterprise Sales Director at SAI360","headline":"Global Online Solutions Account Executive","summary":"I help organizations have their best day every day.  The groups that I am lucky enough to serve and partner with find ways to inspire their most precious asset, their people.  We work together to allow groups to grow and thrive by unleashing their onboard competitive advantage- their culture and values.  Coincidentally, these groups tend to be market leaders at what they do and I suspect their people and the trust and resources they make available to them are a leading contributor to their combined success.  If you and your group would like to learn how we can do this, I'd love to connect and learn some about who you are and where you and your group are headed. ","country":"US","country_full_name":"United States of America","city":"St Petersburg","state":"Florida","experiences":[{"starts_at":{"day":1,"month":7,"year":2023},"ends_at":null,"company":"SAI360","company_linkedin_profile_url":"https://www.linkedin.com/company/sai360/","company_facebook_profile_url":null,"title":"Enterprise Sales Director","description":"At SAI360, we are paving the way to a safer world and better future. Companies across the globe are leveraging SAI360 software and learning solutions to centralize and operationalize their efforts to protect their employees, customers, communities, and brand. Providing real-time visibility across the organization, our tools give companies the ability to monitor their ecosystems, identify gaps, and detect small problems before they become emergencies.","location":"Greater Tampa Bay Area","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/sai360/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=136566219221f67052fe452180b3dbf433bb678ff43420cb11f124b1a19949d0"},{"starts_at":{"day":1,"month":5,"year":2022},"ends_at":{"day":31,"month":7,"year":2023},"company":"UL Solutions","company_linkedin_profile_url":"https://www.linkedin.com/company/ulsolutions/","company_facebook_profile_url":null,"title":"Healthcare Account Executive ","description":"In Healthcare industry innovation, we leverage decades of advanced technical, regulatory, and clinical expertise to help clients manage regulatory and global market access issues and address emerging connected device risks. We help to ensure that medical devices are safe to deploy for use in an increasingly patient-centric and connected environment and support clients in solving critical health, safety, security, and interoperability challenges.\n\nWe also offer world-class industry compliance training for health and life science companies and healthcare providers so they can meet evolving global regulatory expectations.","location":"Tampa, Florida, United States","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/ulsolutions/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=dda703b5cdb680d1fddfb5e413a9030410e5ddb963d87d249196ab57c090e5c0"},{"starts_at":{"day":1,"month":2,"year":2021},"ends_at":{"day":30,"month":6,"year":2022},"company":"Skillsoft","company_linkedin_profile_url":"https://www.linkedin.com/company/skillsoft/","company_facebook_profile_url":null,"title":"Enterprise Account Executive","description":"We believe every person has the potential to be amazing. And that there’s a better way to bring out what they already have in them.  We help organizations lever their most valuable asset, their people, to become better team members, thinkers, producers, and leaders.  Our focus is on helping each and every team member unleash their edge and be amazing, by offering customized journeys to aid your people in moving from who they are to whom they want to be.  How can we help YOU and YOUR ORGANIZATION UNLEASH YOUR EDGE?\n\nSkillsoft delivers online learning, training, and talent solutions to help organizations unleash their edge. Leveraging immersive, engaging content, Skillsoft enables organizations to unlock the potential in their best assets – their people – and build teams with the skills they need for success. Empowering 45 million learners and counting, Skillsoft democratizes learning through an intelligent learning experience and a customized, learner-centric approach to skills development with resources for Leadership Development, Business Skills, Technology & Development, Digital Transformation, and Compliance.\n\nSkillsoft and SumTotal are partners to thousands of leading global organizations, including many Fortune 500 companies. The company features three award-winning systems that support learning, performance, and success: Skillsoft learning content, the Percipio intelligent learning experience platform, and the SumTotal suite for Talent Development, which offers measurable impact across the entire employee lifecycle.","location":"Greater Tampa Bay Area","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/skillsoft/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=220e454b671c486f917526f7e8ead1a5cbff304a001ebd12f55f02e0744fa78c"},{"starts_at":{"day":1,"month":9,"year":2019},"ends_at":{"day":28,"month":2,"year":2021},"company":"Syntrio, Inc.","company_linkedin_profile_url":"https://www.linkedin.com/company/syntrio/","company_facebook_profile_url":null,"title":"Director- Global Accounts","description":"Syntrio, Inc.\nYour one-stop ethics & compliance solution.\nFor over 20 years, organizations have relied on Syntrio’s knowledge, experience, and support to deliver and manage their business and compliance training with complete eLearning solutions and in-depth expertise in online learning design, standards, and technology.\n\nSyntrio merged with Lighthouse Services to become the premier ethics and compliance solution provider to build and sustain a more responsible, aspirational company culture. Our comprehensive platform of products and services reinforces your organization’s code of conduct and related policies. It empowers employees with the newest training content and design, a confidential and anonymous means to raise concerns and manage them. It also provides you with the ability to analyze data and make the necessary changes to accelerate the performance of your workforce.\n\nWe help our clients Manage Risk, Empower Culture and Accelerate Performance!  Give me a call to learn more!","location":"Southern Region, United States","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/syntrio/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=d59c31b0f7a0ba7dedeb77ac4cebfd4dbe5a77e9ffd99686e8953d9ff43bab6e"},{"starts_at":{"day":1,"month":4,"year":2015},"ends_at":{"day":30,"month":9,"year":2019},"company":"LRN","company_linkedin_profile_url":"https://www.linkedin.com/company/lrn/","company_facebook_profile_url":null,"title":"Enlistment Team Member","description":"Our Purpose:  Helping people around the world do the right thing.......\nAre you focused on doing things right or doing more of the right things?  My team helps organizations unleash the power of inspiration to outbehave and outperform the competition.  We offer a comprehensive advisory service practice and library of blended learning to aid in injecting values and principles into the partners we serve.  Often we find that much of the values and principles that created the business are still in place but the ability to communicate and celebrate those shared values has fallen off.  That's where LRN comes in. We bring the quiet revolution to you.\n\nWho are the leaders of the quiet revolution? We are lawyers, consultants, philosophers, engineers, teachers, designers and doctors with experience in non-profit, private, government and legal sectors. While we hail from different corners of the world and work in offices around the globe, we are united by our shared mission to inspire principled performance. Our professional backgrounds and hometowns may vary, but our common purpose is universal. Performance throughout the business world.\n\nNearly two decades later, LRN is impacting business and culture in ways never imagined at its founding. LRN now reaches millions of employees around the globe through world-class online education. LRN is also guiding companies as they build sustainable corporate cultures from the executive suite to the shop floor by demonstrating that HOW you do what you do matters more than ever.\n\nInspiring Principled Performance","location":"Southern US","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/lrn/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=05500e0d8262c5b3a7371fc3f21e1c5c43f905d221d6391ea70e15480db15a3c"},{"starts_at":{"day":1,"month":2,"year":2014},"ends_at":{"day":31,"month":3,"year":2015},"company":"ACL","company_linkedin_profile_url":"https://www.linkedin.com/company/diligent-acl-analytics/","company_facebook_profile_url":null,"title":"Enterprise Account Executive","description":"I help large organizations solve complex audit, risk and compliance issues using our category disrupting Web Based Audit Management and Analytic Platforms.  You probably don't worry about audit issues, BUT if you got something that is keeping you up at night and it's audit related in the Southern US- You need to call me! (see below)\n\nAbout ACL\n ACL delivers technology solutions that are transforming audit and risk management. Through a combination of software and expert content, ACL enables powerful internal controls that identify and mitigate risk, protect profits, and accelerate performance. \n\nDriven by a desire to expand the horizons of audit and risk management so they can deliver greater strategic business value, we develop and advocate technology that strengthens results, simplifies adoption, and improves usability. ACL’s integrated family of products—including our cloud-based governance, risk and compliance (GRC) solution and flagship data analytics products—combine all vital components of audit and risk, and are used seamlessly at all levels of the organization, from the C-suite to front line audit and risk professionals and the business managers they interface with. Enhanced reporting and dashboards provide transparency and business context that allows organizations to focus on what matters. \n\nAnd, thanks to 25 years of experience and our consultative approach, we ensure fast, effective implementation, so customers realize concrete business results fast at low risk. Our actively engaged community of more than 14,000 customers around the globe—including 89% of the Fortune 500—tells our story best. Here are just a few. Visit us online at www.acl.com.\n\nTo learn more about ACL, contact me directly @ Jamie_Woroner@acl.com","location":"Southern Region-US","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/diligent-acl-analytics/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=ea4f12e9d54339e7537cb09fb8b317b2debb3c99dd2159549ce693679448ee2b"},{"starts_at":{"day":1,"month":4,"year":2012},"ends_at":{"day":28,"month":2,"year":2014},"company":"NYSE Governance Services/Corpedia","company_linkedin_profile_url":"https://www.linkedin.com/company/trueofficelearning/","company_facebook_profile_url":null,"title":"Director of Business Development","description":":  NYSE Governance Services is an integrated suite of resources for public and privately held companies worldwide seeking to create a leadership advantage through corporate governance, risk, and ethics and compliance practices. NYSE Governance Services leverages the expertise of Corpedia®, a leader in benchmarking, advisory services, and e-learning, and Corporate Board Member®, a trusted source on governance matters for company directors and C-level executives – both NYSE Euronext companies. NYSE Governance Services offers a range of training programs, advisory services, benchmarking analysis and scorecards, exclusive access to peer-to-peer events and thought leadership on key governance topics for company directors and C-level executives. For more information, visit nyse.com/governance.\n\nI am responsible for new client engagement and ongoing relationship building with large national and international organizations.  I work in a partnership setting with clients legal teams to design a customized set of compliance and ethics tools so that organizations can meet the compliance and regulatory challenges in their specific arena of business.","location":"St. Petersburg, Florida","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/trueofficelearning/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=4ed23dfc0f28b7105cac7900b7c6f880c09325b94e70af88c4e6494a329ffcac"},{"starts_at":{"day":1,"month":1,"year":2010},"ends_at":{"day":31,"month":8,"year":2011},"company":"Morgan Stanley Smith Barney","company_linkedin_profile_url":"https://www.linkedin.com/company/morgan-stanley/","company_facebook_profile_url":null,"title":"Financial Advisor","description":null,"location":null,"logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/morgan-stanley/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=2af6f37a3874bcb2fadb3dcfeb0c11a284a19facebcce01af48ab6fa0f344c36"},{"starts_at":{"day":1,"month":11,"year":2005},"ends_at":{"day":31,"month":1,"year":2010},"company":"eLogic Learning","company_linkedin_profile_url":"https://www.linkedin.com/company/elogic-learning/","company_facebook_profile_url":null,"title":"Vice President","description":"Sales and Marketing\nLearning Management System (LMS) provider with over 50 clients and 4.5 million users on system monthly. Manage and coordinate global sales and marketing effort of the brand and product through a network of employee sales professionals and channel partners.   Project managed the development and delivery of a new client facing web page as well as worked on R&amp;D of on the road technology to take online learning modules anywhere clients require, without connection to internet.\nAccomplishments:\nDeveloped, instituted and managed comprehensive sales and marketing operation that delivered multiple million dollar recurring revenue stream throughout engagement.\nDeveloped and implemented a series of performance and review metrics which doubled sales in 1st year implemented and delivered double digit incremental increases in sales base each year after installation of program.\nManaged and developed an outbound calling penetration program to target market industries.\nCompeted in the RFI/RFP process on multiple Fortune 100 accounts simultaneously closing 30% of submitted RFP's.\nCoordinated and managed trade show activities for our staff and negotiated leases at events.\nNegotiated each contract direct with C-Level management of client companies.\nFull pricing and P&amp;L responsibility on all contracts.\nMember of Tampa Bay Professional Sales Association and a frequent speaker at industry events to include ASTD-SHRM- Training.","location":null,"logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/elogic-learning/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=b1c946dd984227216ea63d996bed3bdd428d0ed5c54bff6d94343f54aacb340b"},{"starts_at":{"day":1,"month":1,"year":2003},"ends_at":{"day":31,"month":1,"year":2005},"company":"Bisk Education","company_linkedin_profile_url":"https://www.linkedin.com/company/bisk-education/","company_facebook_profile_url":null,"title":"Senior Sales Manager","description":"Online Education Company that partners with major universities to provide online regionally accredited degrees and advance business certifications to students world wide.  Responsibilities included hiring and development of sales team to sell online degree programs to general public and within specific corporate verticals.  Directly supervised and was responsible for 80 million in annual revenue generated by a sales team of over 250 sales representatives.  \n\nAccomplishments:\nDeveloped and implemented the direct mail and inbound lead contact strategy for client acquisition within the operation.\nDeveloped and delivered forecasting system that acquired 95% accuracy relative to enrollment in a non-financial aid environment.\nImplemented a targeted training and development program that returned 80% employee retention versus previous 150% attrition in a trailing twelve month measurement.\nNegotiated and managed large corporate learning relationships with Fortune 500 clients to include- Textron, Hamilton Sundstrand, and the US Army.\nMentored and developed subordinate managers and assisted them with the launch of three specific school partnerships in two years.\nWas liaison between Bisk and the admission departments of the Universities for whom we enrolled.\nKey man responsibility with regard to head count and sales and lead follow up program within the degree programs at Bisk Education.","location":null,"logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/bisk-education/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T233346Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=893cb94fef3eb4123b016d37803b50b78a76cd492e322320b5dad832722951ad"}],"education":[{"starts_at":{"day":1,"month":1,"year":1993},"ends_at":{"day":31,"month":1,"year":1998},"field_of_study":"Human Resource Development","degree_name":"BS","school":"University of Florida","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":"https://media.licdn.com/dms/image/C560BAQEEUHxMAR-Q6w/company-logo_400_400/0/1671048447974?e=1703721600&v=beta&t=XdPl7vrM8iZAX1qwNxTzmNS5280K24Cb2diUAtja6Hs","grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":1990},"ends_at":{"day":31,"month":1,"year":1993},"field_of_study":"Business/Commerce, General","degree_name":"AA","school":"St. Petersburg College","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":"https://media.licdn.com/dms/image/C4D0BAQGe45PNbO5zuQ/company-logo_400_400/0/1519856276203?e=1703721600&v=beta&t=SShPyMi4hHm_6Jws440vJcwSxPhj7jhQ-LQhISOEEFg","grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":1986},"ends_at":{"day":31,"month":1,"year":1990},"field_of_study":"General","degree_name":"Diploma","school":"St. Pete High School","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":null,"grade":null,"activities_and_societies":null},{"starts_at":null,"ends_at":null,"field_of_study":null,"degree_name":null,"school":"Villanova University","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":"https://media.licdn.com/dms/image/C4D0BAQGVZYUrw7RmEg/company-logo_400_400/0/1519952288454?e=1703721600&v=beta&t=IX2IghLl9Z88ItbMj9dNC5HfChml-NqWXHhTcJ4TxOM","grade":null,"activities_and_societies":null}],"languages":[],"languages_and_proficiencies":[],"accomplishment_organisations":[],"accomplishment_publications":[],"accomplishment_honors_awards":[],"accomplishment_patents":[],"accomplishment_courses":[],"accomplishment_projects":[],"accomplishment_test_scores":[],"volunteer_work":[{"starts_at":{"day":1,"month":5,"year":2011},"ends_at":null,"title":"Volunteer- Labor","cause":"CHILDREN","company":"Chidren's AIDS Foundation of Tampa Bay","company_linkedin_profile_url":null,"description":"Help Annually at the Derby Day Children's AIDS Foundation of Tampa Bay with Set Up and Tear Down of the Hospitality Area well as the cleaning and maintenance of the property on which this tremendous even is held.  Am also an annual donor to this event and the foundation which it supports.","logo_url":null},{"starts_at":{"day":1,"month":4,"year":2006},"ends_at":null,"title":"Volunteer /Donor","cause":"CHILDREN","company":"Ywca Family Village","company_linkedin_profile_url":"https://www.linkedin.com/company/ywca-family-village/","description":"Participate in the annual adopt a family for he holidays. Donated playground and class room equipment.  I have been a volunteer speaker at annual board foundation events and have provided professional advice and counsel to center staff.","logo_url":null}],"certifications":[],"connections":null,"people_also_viewed":[{"link":"https://www.linkedin.com/in/daryl-resnick-saig","name":"Daryl Resnick","summary":"Experienced Compliance and Ethics Account Exec - We're Hiring!","location":null},{"link":"https://www.linkedin.com/in/charles-freericks","name":"Charles Freericks, CCEP","summary":"Director, Learning Programs and Advisory - SAI360","location":null},{"link":"https://www.linkedin.com/in/peter-epstein","name":"Peter Epstein","summary":"Enterprise Account Executive at SAI Global","location":null},{"link":"https://www.linkedin.com/in/jennifer-otoole","name":"Jennifer O'Toole","summary":"Vice President, Global Demand Gen and Customer Marketing","location":null},{"link":"https://www.linkedin.com/in/tokeefe","name":"Thomas O'Keefe","summary":"CEO, Board Member, Operating Partner in Private Equity.","location":null},{"link":"https://www.linkedin.com/in/chris-long-88964a12","name":"Chris Long","summary":"Corporate Account Executive & Team Lead at Intelligize, Inc.","location":null},{"link":"https://www.linkedin.com/in/ciscilysawyer","name":"Ciscily Sawyer,  MHA","summary":"Sr. Financial Analyst","location":null},{"link":"https://www.linkedin.com/in/don-ritter","name":"Don Ritter","summary":"Sales Management | Call Center Management | Quality Assurance | Training | Process Improvement | Compliance | Employee Development | Recruiting","location":null},{"link":"https://www.linkedin.com/in/brookemosley","name":"Brooke Mosley","summary":"Senior Client Advocate & Blessed Dad to two amazing daughters","location":null},{"link":"https://www.linkedin.com/in/jsunbailey","name":"J-sun Bailey","summary":"Information Technology Manager at County of Waldo county","location":null}],"recommendations":[],"activities":[],"similarly_named_profiles":[],"articles":[],"groups":[],"skills":[],"inferred_salary":null,"gender":null,"birth_date":null,"industry":"Information Technology and Services","extra":null,"interests":["Animal Welfare","Arts and Culture","Children","Economic Empowerment","Environment","Politics","Science and Technology"],"personal_emails":[],"personal_numbers":[]}