{"public_identifier":"anne-marie-van-wyk","profile_pic_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/person/anne-marie-van-wyk/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240930%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240930T201154Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=f1a49def6755503dbde7e7180b741e713e278dd850ff5ea7e61f8307aceac82a","background_cover_image_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/person/anne-marie-van-wyk/cover?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240930%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240930T201154Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=f469528947c0217ecfe7700264febfb1276f6dbc1ff9314cb64192b0526aae40","first_name":"Anne-Marie van Wyk, PhD,","last_name":"CCXP","full_name":"Anne-Marie van Wyk, PhD, CCXP","follower_count":null,"occupation":"Founder & Chief Enabler at BigRed CX Innovation","headline":"Customer & Employee Experience Evangelist | Innovation Catalyst | Supply Chain Guru | Business Intelligence Advocate","summary":"I believe that superior customer experience starts from within. Customer centricity does not happen through words on paper, but rather through the action and behaviour of people.\n\nThis passion for the upliftment and development of customer-facing employees motivated me to focus my doctoral thesis on the art of establishing a customer-centric culture in diverse and decentralized organizations - with structured innovation the catalyst for organizational transformation.\n\nSince then, I have been applying this thinking within global organizations in the logistics, automotive, consumer goods, healthcare, and mining & manufacturing industries.\n\nIn my senior Business Innovation role at Imperial Logistics, I led the team in co-creating and implementing an inclusive empowerment and performance-driven customer-centric value system for client-facing team members across 33 countries. We jointly persevered and prevailed in the implementation of this value system across diverse cultures - encompassing South Africa, Nigeria, Ghana, Germany, the Netherlands et al - through the alignment of processes (sales support business development enablement & client account management) and enabling Technologies (CRM, BI etc.)\n\nMy strong right and left-brain capabilities enable me to effectively think both creatively and analytically in order to translate strategies into workable implementable programs that facilitate learning and innovation whilst achieving required ROI. I have successfully led business turnaround efforts as well as growing start-ups into profitable organizations.\n\nMeeting these objectives whilst having fun is where my passion for innovation meets creativity. The facilitation of positive employee experiences and the establishment of an embedded customer-centric culture guarantees positive customer experiences.\n\nIf you would like to see how a new set of eyes and fresh vision can transform your customer experience - or you would like to expand your professional network- connect here or email me at avanwyk22@outlook.com","country":"CA","country_full_name":"Canada","city":"Erin","state":"Ontario","experiences":[{"starts_at":{"day":1,"month":12,"year":2019},"ends_at":null,"company":"BigRed CX Innovation","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Founder & Chief Enabler","description":"Position objective:Established and grow start-up experience management and supply chain consultancy firm. Craft and design customized innovative experience management solutions, business process design and CRM strategies that will improve the competitiveness of our customer base. Enabling our client’s growth aspirations by providing systems and enabling insights that support business & functions and by facilitating access to new value propositions and revenue streams.Key responsibilities:•Work delivered for Mining GPO:~CRM system requirement specification, vendor evaluation and implementation.~Organizational business process design and implementation.~Design of Technology architecture that is linked to business capabilities.~Design and implementation of experience processes of organization stakeholders~Deploy a digital strategy that enables them to build partnerships across their ecosystem, and to identify, pre-empt, integrate potentially disruptive technologies and businesses.•Using effective data visualization methods through dashboards, supported by storytelling techniques to assist the business to transform data into meaningful and actionable information that inspires action for growth.•Implementation of NPS and VOC programs for various clients.•Design the roadmap for how all the areas of focus (NPS, human-centred Design, culture) will work together globally and within the segments to achieve their customer-centricity ambitions.•Apply Design Thinking methodologies to help clients develop deeper insights into problem spaces and create more innovative solutions to their prioritized challenges.•Assist college professor to co-develop the “Customer Experience Design” course curriculum for Centennial College.•Assist in the design of high-impact CX training material for CEOs directly and through TEC Canada.•CX solution development, marketing collateral and campaigns for Experience Management solution provider organization.","location":"Erin, Ontario, Canada","logo_url":null},{"starts_at":{"day":1,"month":1,"year":2020},"ends_at":null,"company":"Acceleration Strategy Inc","company_linkedin_profile_url":"https://ca.linkedin.com/company/acceleration-strategy-inc","company_facebook_profile_url":null,"title":"Director XM Learning & Solution Development","description":"Position objective:Co-developed various world-class CX Mastery Course curriculums and facilitated the online course deployment. The 11-week curriculum has been designed around CXPA certification best practices combined with practical application derived from real-life cases. Develop business models to support the implementation of experience management disciplines for customers across North America.Key responsibilities:•Established the Acceleration Academy – Canada’s first CXPA Recognised Training Provider•Development of innovative CX governance and culture solution offerings•Management of professional CX training programs –frameworks, content, budgets, marketing collateral, and delivery•Digital Marketing delivery•Perform needs analysis of training requests and develop learning solutions based on the results of the analysis•Using data and feedback to drive improvements in resources and practices•Design custom training programs for the organization based on requests received from the business•Content design for Customer Experience disciples training: CX Strategy, Customer Understanding (Journey mapping, VOC), Customer Experience Design. CX Metrics and measurement (NPS, CES, CSAT), Governance, Culture enablement.•Development of CX Design implementation guideposts to guide clients to successful CX implementations.","location":"Toronto, Ontario, Canada","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/acceleration-strategy-inc/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240930%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240930T201155Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=d2dcdd5e820fbee7f662433a1dd285404e50b63948a1292ebfb74e90e772bb36"},{"starts_at":{"day":1,"month":7,"year":2015},"ends_at":{"day":31,"month":8,"year":2019},"company":"Imperial Logistics, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Business Innovation Executive","description":"Position objective:Focused on continuous improvement of client-facing business development/sales processes and programmes. Translated the Imperial Logistics customer-centricity and innovation management strategy into a functional and measurable execution model across all levels of client-facing and marketing staff. Enablement of a client-centric culture through supporting business development people, processes, and technology across the global organization, JSE listed Imperial Logistics Limited that has revenue exceeding R50 billion and EBITDA of R5 million and 28 000 people across 33 countries.Key responsibilities:•Drove client experience management initiatives (Staff development, net promoter score, voice of the customer surveys, marketing and communication campaigns, organizational alignment, etc.)•Participated in the development of the global corporate, various industry and digitization strategies•Supported marketing team in customer event planning and coordination•Managed complex divisional budgets•Designed and implemented research methodologies to support business development intelligence•Organized and hosted global customer-centricity and innovation management rewards and recognition events for top-performing staff•Drove customer-led innovation initiatives through design thinking practices•Spearheaded global customer management software evaluation and selections•Pioneered the Imperial Innovation Fund (250 million ZAR) with the focus of harvesting and incubating internal innovation ideas•Mentored Logistics and Strategic Management Masters Students at the University of Johannesburg","location":"Gauteng, Bedfordview","logo_url":null},{"starts_at":{"day":1,"month":12,"year":2012},"ends_at":{"day":30,"month":6,"year":2015},"company":"Imperial Logistics, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Group Executive – Business Development","description":"Position objective:Manage customer relationships and expectations effectively and proactively across various levels of the customer’s business. Effective development of end-to-end supply chain solutions, across all business units within the organization, that ensure the customer’s competitiveness and relevance in the markets that they operate.Key responsibilities:•Facilitated the maturing of our relationships with the defined top tier clients through defining and overseeing structured measurements and processes•Ensured appropriate relationships are established across all identified levels within the client organization and across all involved operating companies.•Translated client requirements and expectations to benefit operating companies across divisions and regions•Ensured consistent high-quality proposals and tender submissions•Developed innovative commercial models to drive mutually beneficial business success•Business Unit Manager for “managed services BU at Volition Consulting (Operating company within Imperial Logistics)","location":"Gauteng, Bedfordview","logo_url":null},{"starts_at":{"day":1,"month":7,"year":2010},"ends_at":{"day":30,"month":11,"year":2012},"company":"Imperial Logistics, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Supply Chain Integration Executive","description":"Position objective:Responsible for expanding relationships with major clients, through the expansion of the organization's service offerings and customer improvement and innovation initiatives.  Coordinate and grow capabilities and service offerings of the various operating companies to enable Imperial Logistics to provide end-to-end solutions to meet the expanding needs of existing and potential clients.Key responsibilities:•Developed advanced and sophisticated supply chain processes and methodologies to support the global product offering•Managed and defined key strategic supply chain integration projects across divisions for key customers•Responsible for supply chain strategies for over 70 operating companies within Imperial Logistics•Strengthened service offering through value-adding, professional supply chain & logistics integration services•Expanded commercial service offering beyond transport and warehousing into all aspects of operations outsourcing.•Actively participated in the continued evolution of Imperial Logistics towards an integrated supply chain, logistics and operations provider through process improvement and technology advancement","location":"Gauteng, Bedfordview","logo_url":null},{"starts_at":{"day":1,"month":7,"year":2008},"ends_at":{"day":30,"month":6,"year":2010},"company":"Imperial Strategic Supplychain Services / Imperial Group (Pty) Ltd, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Divisional CEO","description":"Position objective:Established a new start-up support organization within the Imperial Group as an independent profitable business unit to provide superior supply chain service support to the companies within the Autoparts Division.Specialize in supply chain process optimization initiatives ranging from automotive parts distribution, inventory optimization, and warehouse improvement projects.Specialize in supply chain process optimization initiatives ranging from automotive parts distribution, inventory optimization, and warehouse improvement projects.Key responsibilities:•Member of executive committees and divisional board•Developed and executed Business strategy, managing a viable and independent business unit•Supervised, coached, trained and mentored personnel, including senior general managers•Business development, sales and marketing•Customer service liaison, building strong working relationships and effective communication channels with key stakeholders, resolving complaints and enquiries•Outsourced inventory optimization and product management including procurement and managing warehouse•Consulted in Supply chain optimization•Managed financial billing and budgets with monthly reporting","location":"Gauteng, Bedfordview","logo_url":null},{"starts_at":{"day":1,"month":7,"year":2006},"ends_at":{"day":30,"month":6,"year":2008},"company":"Commercial Vehicle Holdings / Imperial Group (Pty) Ltd, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"General Manager - Parts and Logistics","description":"Position objective:Optimisation of the after-sales parts supply chain for International, Peterbilt DAF and Renault commercial vehicles – from product initiation, forecasting, planning, inbound logistics, warehousing and the outbound customer delivery.Key responsibilities:•Performed as a strong leader of a cohesive team with strict enforcement of health, safety and statutory regulations, governance processes and compliance requirements. Member of the executive committee.•Optimized Inventory and product management including procurement and warehouse management•Supervised, coached, trained and mentored personnel, including senior general managers•Managed financial billing and budgets with monthly reporting•Developed supply chain processes and methodologies to support product offerings, managing the complete supply chain of all parts•Oversaw supply chain costing, retail standards, management reporting, systems and processes•Responsible for inbound and outbound distribution processes","location":"Gauteng, Germiston","logo_url":null},{"starts_at":{"day":1,"month":1,"year":2003},"ends_at":{"day":30,"month":6,"year":2006},"company":"DaimlerChrysler South Africa, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Vehicle Logistics Manager","description":"Position objective:Responsible for the logistics flow of all Mercedes Benz, Chrysler, Mitsubishi, Freightliner, Western Star passenger cars and commercial vehicles from point of origin through to delivery to the dealer, incorporating effective supplier measurement and management.Key responsibilities:•Supervised, coached, trained and mentored personnel•Focused strongly on implementing continuous process improvements•Managed all land transportation, shipping, importation and storage activities and processes•Oversaw multiple logistics service providers, inventory, budgets and processes•Negotiated and managed supplier contracts","location":"Gauteng, Pretoria","logo_url":null},{"starts_at":{"day":1,"month":1,"year":2002},"ends_at":{"day":31,"month":12,"year":2002},"company":"Microsoft South Africa, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Product Specialist","description":"Position Objective:Management of the product strategy as well as all business functionality of the ERP systems. This includes the business process analysis and management of implementation projects. Provided all the Navision Axapta partners with support and training. The key focus was on the supply chain, trade, manufacturing, financials, projects and CRM modules of the Axapta system.Key Responsibilities:•Define and implement the Axapta product strategy•Management of all business-related product issues•Provide the business partners with sales, training and implementation support•Continuous research on supply chain topics•Writing whitepapers and giving industry talks•Business process analysis•Business process improvement (supply chain, CRM, manufacturing, project management, financials, knowledge management)•Project management of implementation projects•Provide ASP partners (Application System Providers) with sales and implementation support•Quality control on all partner activities","location":"Gauteng, Rivonia","logo_url":null},{"starts_at":{"day":1,"month":1,"year":2000},"ends_at":{"day":31,"month":12,"year":2001},"company":"Rubico (Pty) Ltd, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Logistics Manager / Process Improvement Specialist","description":"Position Objective:Responsible for the development and implementation of a Software Deployment Methodology, including the management of the Logistics of this process. Other activities include the coordination of deployment activities, quality assurance of products delivered for deployment, the management of the configuration control register, the coordination of Logistics with sales and marketing and the coordination of Rubico licenses at customer sites.Coordinating the software supply chain. This includes the management of all the components of the supply chain; customer integration, supplier integration, product deployment and quality assurance of the process. Designed and implemented a Process Support Competence with the main focus of designing and implementing necessary business processes. This involves continuous process improvement through regular process assessments and audits.Key Responsibilities•\tDevelopment and implementation of deployment methodology, including logistics•\tCoordination of software deployment activities•\tQuality Assurance on products delivered for deployment•\tConfiguration management register•\tCoordinating logistics with Sales & Marketing•\tCoordinating Rubico licenses at customer sites","location":"Gauteng, Rivonia","logo_url":null},{"starts_at":{"day":1,"month":11,"year":1998},"ends_at":{"day":31,"month":12,"year":1999},"company":"The Logistics Bureau (PTY) Ltd, ZA","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Product Manager: Advance Routing Centre","description":"Position Objective:Responsible for the creation of a virtual Internet based routing centre to manage the transport function of various customers and the management of all the projects of a US developed Transport Management application – Manugistics Transport Management.","location":"Gauteng, Rivonia","logo_url":null}],"education":[{"starts_at":{"day":1,"month":1,"year":2017},"ends_at":{"day":31,"month":12,"year":2019},"field_of_study":"Enigineering Management","degree_name":"Doctor of Philosophy - DPhil","school":"University of Johannesburg","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":"https://media-exp1.licdn.com/dms/image/C4D0BAQGP1lwoILrIcQ/company-logo_100_100/0/1565777374464?e=1636588800&v=beta&t=sjYGEVxnUSaEnD7D7CwvgwXJhrol2tPp-B6F9DSeoKU","grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":2000},"ends_at":{"day":31,"month":12,"year":2002},"field_of_study":"Supply Chain/Software","degree_name":"MSc Electrical and Information Engineering","school":"University of the Witwatersrand","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":"https://media-exp1.licdn.com/dms/image/C560BAQGWPZCDa0rFXg/company-logo_100_100/0/1519856575121?e=1636588800&v=beta&t=vPOBwD2kpra8NFYbvjCoDhXN84nldOx443fn5pL5czQ","grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":1998},"ends_at":{"day":31,"month":12,"year":2000},"field_of_study":"Logistics, Materials, and Supply Chain Management","degree_name":"Bachelor of Commerce (BCom) - Honours","school":"Rand Afrikaans University","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":null,"grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":1995},"ends_at":{"day":31,"month":12,"year":1998},"field_of_study":"Majored in Logistics","degree_name":"Bachelor of Commerce (BCom) - Marketing","school":"Rand Afrikaans University - RAU","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":null,"grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":1990},"ends_at":{"day":31,"month":12,"year":1994},"field_of_study":"12","degree_name":"Matric","school":"Kempton Park High School","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":null,"grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":2016},"ends_at":null,"field_of_study":"Customer Centricity: Game Changing Strategy Design & Execution","degree_name":"Certificate","school":"GIBS Business School (Gordon Institute of Business Science)","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":"https://media-exp1.licdn.com/dms/image/C4E0BAQHciDsJ2ZR85Q/company-logo_100_100/0/1539066691008?e=1636588800&v=beta&t=FcrMh9Kc5OBa6l0X79OtsWBERu5NBYCZTu4OYjiILzM","grade":null,"activities_and_societies":null},{"starts_at":{"day":1,"month":1,"year":2011},"ends_at":null,"field_of_study":"Executive Business Management Program","degree_name":"Certificate","school":"GIBS Business School (Gordon Institute of Business Science)","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":"https://media-exp1.licdn.com/dms/image/C4E0BAQHciDsJ2ZR85Q/company-logo_100_100/0/1539066691008?e=1636588800&v=beta&t=FcrMh9Kc5OBa6l0X79OtsWBERu5NBYCZTu4OYjiILzM","grade":null,"activities_and_societies":null}],"languages":[],"languages_and_proficiencies":[],"accomplishment_organisations":[],"accomplishment_publications":[],"accomplishment_honors_awards":[{"title":"Golden Key International Honour Society","issuer":"Invitation issued by Dean - Golden Key International Honour Society","issued_on":{"day":1,"month":4,"year":2019},"description":"Golden Key has emerged as one of the most dynamic, forward-thinking organizations in higher education. Committed to an ethos of recognizing academic achievement and encouraging altruistic service, the Society’s on-campus presence has reached over 400 chapters at colleges and universities in eight countries: Australia, Canada, India, Malaysia, New Zealand, South Africa, The Bahamas and the United States."}],"accomplishment_patents":[],"accomplishment_courses":[],"accomplishment_projects":[],"accomplishment_test_scores":[],"volunteer_work":[],"certifications":[{"starts_at":{"day":1,"month":2,"year":2021},"ends_at":null,"name":"Member of Golden Key International Honour Society","license_number":null,"display_source":null,"authority":"Golden Key International Honour Society","url":null},{"starts_at":{"day":1,"month":11,"year":2004},"ends_at":null,"name":"Associate member of the Southern African Institute for Industrial Engineering","license_number":"1757","display_source":null,"authority":"Southern African Institute for Industrial Engineering","url":null},{"starts_at":{"day":1,"month":10,"year":2001},"ends_at":null,"name":"ISO/IEC 15504 Software Process Improvement and Capability Determination (SPICE)","license_number":"000063","display_source":null,"authority":"QAI Global Institute","url":null},{"starts_at":{"day":1,"month":12,"year":2020},"ends_at":{"day":31,"month":12,"year":2022},"name":"Certified Customer Experience Professional - CCXP","license_number":"#000-1492","display_source":"www.cxpa.org","authority":"Customer Experience Professionals Association (CXPA)","url":"https://www.cxpa.org/earn-your-ccxp/ccxpconfirmation"}],"connections":500,"people_also_viewed":[{"link":"https://za.linkedin.com/in/ann-marie-van-wyk-6b199b141","name":"Ann-Marie van Wyk","summary":"Consulting services","location":"Johannesburg Metropolitan Area"},{"link":"https://www.linkedin.com/in/juliebenlevizeff","name":"Julie Benlevi","summary":"Chief Executive Officer at Perpetua Labs","location":"New York, NY"},{"link":"https://ca.linkedin.com/in/izabellagabowicz","name":"Izabella Gabowicz","summary":"COO at Sensibill","location":"Toronto, ON"},{"link":"https://za.linkedin.com/in/fahmida-ebrahim-4b107953","name":"Fahmida Ebrahim","summary":"Head of Regulatory Affairs and Quality Assurance at Unimed Healthcare (Pty) Ltd","location":"City of Johannesburg"},{"link":"https://za.linkedin.com/in/wendy-makhoba-5b339912a","name":"Wendy Makhoba","summary":"Human Resources Manager at Pharmed Pharmaceuticals","location":"City of Johannesburg"},{"link":"https://id.linkedin.com/in/husyair-syair-22008315a","name":"Husyair Syair","summary":"Tyre fitter and technical tyre at Magna industry and tyres","location":"Samarinda"},{"link":"https://uk.linkedin.com/in/gemma-colby-%%F0%%9F%%8C%%88-21175132","name":"Gemma Colby 🌈","summary":"Head Of Customer Experience at Yell | Founding member of Women in CX","location":"Greater Reading Area"},{"link":"https://ca.linkedin.com/in/fbrill","name":"Francois Brill","summary":"Product. Design. Business","location":"Greater Vancouver Metropolitan Area"},{"link":"https://it.linkedin.com/in/marco-gabrielli-09319371","name":"Marco Gabrielli","summary":"C.O.O. at HYPERTYM owned by HYT S.r.l.- OTR tyre recycling as a new source for circular economy","location":"Rovereto"},{"link":"https://in.linkedin.com/in/kiran-ahir-6a2aaa167","name":"Kiran Ahir","summary":"experienced mechanical  engineer||production||operations||management||open for management + engineering opportunities","location":"Mandvi"},{"link":"https://eg.linkedin.com/in/sayed-abouelenean-027786202","name":"Sayed Abouelenean","summary":"Import Manager","location":"El Mansoura"},{"link":"https://ae.linkedin.com/in/mohammed-azgar-544a0b124","name":"Mohammed Azgar","summary":"Recruitment and Licensing Specialist at American Hospital Dubai","location":"Dubai, United Arab Emirates"},{"link":"https://sa.linkedin.com/in/anfal-a-alghamdi-b0109968","name":"Anfal A. Alghamdi","summary":"Talent Acquisition | Unlocking Talents | Recruitment","location":"Saudi Arabia"},{"link":"https://ca.linkedin.com/in/steve-hewitt-67687239","name":"Steve Hewitt","summary":"Executive Chairman at Gymshark","location":null},{"link":"https://ca.linkedin.com/in/derek-bildfell-4ab977","name":"Derek Bildfell","summary":"Principal Consultant at Acceleration Strategy Inc","location":"Greater Toronto Area, Canada"},{"link":"https://ca.linkedin.com/in/mhmurray","name":"Matthew Murray","summary":"Research and Strategy Consulting","location":"Toronto, ON"},{"link":"https://ca.linkedin.com/in/randydanso","name":"Randy Agyeman-Danso","summary":"Project Director at Acceleration Strategy Inc.","location":"Toronto, ON"},{"link":"https://za.linkedin.com/in/percival-edward-8731b71b5","name":"Percival Edward","summary":"--","location":"Pretoria"},{"link":"https://ca.linkedin.com/in/chrisramseychapman","name":"Chris Chapman","summary":"Helping business leaders plan and execute for accelerated results.  DM for consultation.","location":"Greater Toronto Area, Canada"},{"link":"https://ca.linkedin.com/in/jamesterryinc","name":"James Terry","summary":"Corporate Strategist | Assisting companies with a strategy & structure for growth","location":"Vancouver, BC"}],"recommendations":[],"activities":[{"title":"Congratulations to Canada's Women Soccer team. Such an inspiration for our young daughters and sons! #inspiration  #teamcanada","link":"https://www.linkedin.com/signup/cold-join","activity_status":"Liked by Anne-Marie van Wyk, PhD, CCXP"},{"title":"Having the right Top Talent on your team is a game changer! Laura Gutierrez  , one of the The INSIDE View Inc.’s newest team members, and our…","link":"https://www.linkedin.com/signup/cold-join","activity_status":"Liked by Anne-Marie van Wyk, PhD, CCXP"},{"title":"I don't know about you guys, but it seems I have received more unsolicited calls from cold-calling agencies (on my mobile!) than ever before since…","link":"https://www.linkedin.com/signup/cold-join","activity_status":"Liked by Anne-Marie van Wyk, PhD, CCXP"}],"similarly_named_profiles":[],"articles":[],"groups":[],"skills":[],"inferred_salary":null,"gender":null,"birth_date":null,"industry":null,"extra":null,"interests":[],"personal_emails":[],"personal_numbers":[]}