{"public_identifier":"conniehagston","profile_pic_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/person/conniehagston/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T191126Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=7973241fe92912eb19a23d238ebc1b5c129cc33e0191144d64066b8aa05702b3","background_cover_image_url":null,"first_name":"Connie","last_name":"Hagston","full_name":"Connie Hagston","follower_count":null,"occupation":"Director of Sales and Marketing at Chaminade Resort & Spa","headline":"Director of Sales and Marketing","summary":"Dynamic Sales Leader with a passion for creatively helping teams solve any sales and marketing objection. Recognized for developing and motivating sales and marketing professionals with a proven track record of exceeding sales goals. Ability to think strategically and take appropriate business risks. Excellent interpersonal, communication, and negotiation skills.  Communicates and works well with all levels of Management and Ownership. Easily adapts to changing marketplace conditions. \n\nAdditional core competencies include:\nStrategic Account Management| Lead Sales Teams| Develop Marketing Plans |Strong Sales Negotiations |Brand Positioning| Creative Sales Plans|Brand Development | Strategic Business Analysis | Relations Management | Budget Analysis & Forecasting | Talent Acquisition| Collaborative Leader\n\t  \n","country":"US","country_full_name":"United States of America","city":"Santa Cruz","state":"California","experiences":[{"starts_at":{"day":1,"month":8,"year":2017},"ends_at":null,"company":"Chaminade Resort & Spa","company_linkedin_profile_url":"https://www.linkedin.com/company/chaminaderesort/","company_facebook_profile_url":null,"title":"Director of Sales and Marketing","description":"Having recently completed a $10M transformation, Chaminade Resort & Spa is now more than ever a haven where you can escape and feel so far away yet be so close to beaches, mountains, world-class wineries and so much more!\n \n*             300 lush acres in a luxurious, retreat-like setting with sweeping views of Monterey Bay\n*             156 comfortable guest rooms nestled among the towering Eucalyptus and natural landscape\n*             Over 12,000 square feet of newly renovated indoor meeting space which provide the luxuries of a resort combined with an approved conference center\n*             Two transformed restaurants in a casually elegant setting with expansive ocean views in the Sunset Restaurant\n*             Five minutes from golf courses, the beach, and downtown Santa Cruz\n*             The Spa at Chaminade, complete with a private spa patio overlooking a peaceful wooded valley and featuring a fitness center - reopening soon 2021\n*             Highly attentive and detailed team ensuring your conference is an outstanding success","location":"Santa Cruz, California","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/chaminaderesort/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T191126Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=8335b6e784b56608723f30d919eb37421fd7c4aa3748329d69fc7939fb0d59f1"},{"starts_at":{"day":1,"month":7,"year":2010},"ends_at":{"day":1,"month":3,"year":2017},"company":"Silverado Resort and Spa","company_linkedin_profile_url":"https://www.linkedin.com/company/silverado-resort/","company_facebook_profile_url":null,"title":"Director Sales & Marketing","description":"365 guest rooms, 17,000 sq. ft. (indoor) meeting/event space and extensive outdoor venues\nFull service resort, two championship golf courses - home to the annual PGA Safeway Tournament\n10 pools and 10 tennis courts\nLeader and director for marketing, revenue management, sales, catering and conference services teams. \nEstablish strategic action plans for each manager and maximize performance through outside sales calls, prospecting, training, motivation, and effective supervision. Train staff on establishing rapport and developing positive customer relationships built on effective listening, problem-solving, total account management and efficient follow-through.  \n•\tTransitioned resort to new local ownership and management by Dolce Hotels and Resorts July 2010 and again to Wyndham Hotels and Resorts in January 2015.  Successfully lead team through a series of renovations projects including the conference center and an ongoing guest room renovation project. Actively participated in implementation of new culture, training, and process improvements through both transitions\n•\tStrategically rebuilt sales/catering team to improve revenues and profits prior to \n•\tOccupancy growth from 32% in 2012 to 65%-year end 2016\n•\tRevenue growth from $42M in 2012 to $65M year end 2016\n•\tEIBITA growth from $520K in 2012 to $8M year end 2016\n•\tAwarded 2014 Sales Team of the Year for Dolce Hotels and Resorts","location":"Napa, California","logo_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/company/silverado-resort/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20241001%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20241001T191126Z&X-Amz-Expires=1800&X-Amz-SignedHeaders=host&X-Amz-Signature=6460c6e3edd05b36d713610a8c49f6832882aa894ae06891c263d7448acd8c24"},{"starts_at":{"day":1,"month":7,"year":1994},"ends_at":{"day":1,"month":7,"year":2009},"company":"Marriott Hotels and Resorts","company_linkedin_profile_url":null,"company_facebook_profile_url":null,"title":"Sales and Marketing","description":"Director Sales and Marketing (2004-2009)\nThe Lodge at Sonoma, a Renaissance Resort & Spa,  Sonoma, CA\n182 guest rooms and 15,000 sq. ft.\t\n(All on-property jobs eliminated due to Marriott’s Sales Force One redeployment)\n*Created strategy to improve wedding business, grew wedding events 252% and overall banquet catering revenue 132%+\n*Achieved customer satisfaction by troubleshooting various technologies, attaining efficient network environments for high-volume production printers, assuring image quality, and promptly resolving issues.\n* Managed $230,000 marketing budget utilizing print, direct mail and eCommerce for resort including Raindance Spa and Carneros Bistro & Wine Bar \n\nADDITIONAL PREVIOUS EXPERIENCE, MARRIOTT, VARIOUS ROLES INCLUDING: \nDIRECTOR OF SALES AND MARKETING – RENAISSANCE ATLANTA DOWNTOWN         4/2000 - 9/2004\nDIRECTOR OF GROUP SALES – RENAISSANCE WAVERLY ATLANTA                                    4/1998 - 4/2000\nSENIOR SALES MANAGER – RENAISSANCE WAVERLY                                                              7/1995 - 2/1998\nNATIONAL SALES MANAGER – STOUFFER RENAISSANCE NSO WASH. DC                       1/1995 - 7/1995\nSENIOR SALES MANAGER – STOUFFER NASHVILLE                                                                  4/1992 - 1/1995","location":null,"logo_url":null}],"education":[{"starts_at":{"day":1,"month":1,"year":1979},"ends_at":{"day":1,"month":1,"year":1981},"field_of_study":"Business","degree_name":"Associate Degree","school":"Blair Business College","school_linkedin_profile_url":null,"school_facebook_profile_url":null,"description":null,"logo_url":null,"grade":null,"activities_and_societies":null}],"languages":[],"languages_and_proficiencies":[],"accomplishment_organisations":[],"accomplishment_publications":[],"accomplishment_honors_awards":[],"accomplishment_patents":[],"accomplishment_courses":[],"accomplishment_projects":[],"accomplishment_test_scores":[],"volunteer_work":[],"certifications":[],"connections":null,"people_also_viewed":[{"link":"https://www.linkedin.com/in/brynnkessler","name":"Brynn Kessler","summary":"Associate Director of Sales at Chaminade Resort + Global Account Manager at BENCHMARK","location":null},{"link":"https://www.linkedin.com/in/flavia-oliveira-chia-88164a65","name":"Flavia Oliveira, CHIA","summary":"Director Of Sales Marketing at Visit Santa Cruz County","location":null},{"link":"https://www.linkedin.com/in/dan-smart-6a8b8711","name":"Dan Smart","summary":"Director of Sales & Marketing | Dream Inn Santa Cruz | Ensemble Hospitality | \"Foster Creativity with a Authentic Santa Cruz Experience\"","location":null},{"link":"https://www.linkedin.com/in/julieramey","name":"Julie Ramey","summary":"Fueling the success of others and loving every minute of it","location":null},{"link":"https://www.linkedin.com/in/krysta-souza-a12224106","name":"Krysta Souza","summary":"Sales Coordinator at Chaminade Resort & Spa","location":null},{"link":"https://www.linkedin.com/in/dawnaronson66","name":"Dawn Aronson","summary":"Sales Manager at Asilomar Conference Grounds","location":null},{"link":"https://www.linkedin.com/in/dolord","name":"Doug Lord","summary":"Hospitality Executive | ex-Disney | Business Strategy | Team Leadership | Finance | Growth Driver | Cross Functional Collaboration | Process Improvement | Budgeting & Capital Planning | Labor Mgmt | Public Speaking","location":null},{"link":"https://www.linkedin.com/in/kevin-herbst-aa855311","name":"Kevin Herbst","summary":"General Manager Margaritaville Resort Lake Conroe","location":null},{"link":"https://www.linkedin.com/in/william-donnelly-71945954","name":"William Donnelly","summary":"Executive Chef, CDM, CFPP","location":null},{"link":"https://www.linkedin.com/in/ty-milton-35407b1a2","name":"Ty Milton","summary":"I AM JUST WHAT YOU ARE LOOKING FOR","location":null}],"recommendations":["Ashley Parrish\n\n\n\nConnie has been instrumental in my growth in the hospitality industry. Her experience and leadership was a key factor in the success and growth of our property. She would be an asset to any organization. I will be forever grateful for her mentorship. ","David Johnson\n\n\n\nOur group has worked with Connie as our customer for several years. Aside from being a valued customer of my organization, myself and my group has enjoyed working with Connie very much. She gives great feedback and keeps lines-of-communication open to continue efforts to move things forward. Due to her leadership, her teams are always one of the most organized. ","Julie Maurer\n\n\n\nConnie is a dynamic sales and marketing professional, specializing in the hospitality industry.  She successfully led a sales team that consistently exceeded goals.  Through her experience and knowledge of the sales field she was able to mentor and raise the bar for many of her team assisting with their success.  She is passionate about the hospitality field and always brings energy to the job.","Myra Howay\n\n\n\nI had the pleasure of working for Connie Hagston for 3 years at Silverado Resort and Spa as my Director of Sales and Marketing.  Connie is a strong and talented leader who led our Sales team to several yearly annual awards for being the best within Dolce and later within Wyndham.  Connie was great at mentoring our team during our daily morning revenue discussions, at our sales meetings and always offered her guidance when we reached out to her.  I always appreciated her responsiveness and feedback, she was a great resource.  \r\nI very much enjoyed working for Connie and I highly recommend her as a  Director who can lead a sales team to exceeding their revenue goals as individuals and as a team. ","Sandy Wong\n\n\n\nI had the pleasure of working with Connie for 4 years, she hired me and was a mentor throughout that time.  She lead a successful sales team and taught me how to think analytically and strategically about the business.  She would be a great asset to any organization.","Chris Costas\n\n\n\nI had the great pleasure of working alongside Connie at Silverado Resort for 3 years. In this time Connie was a leader even among the executive team helping to guide the resort to over a 1000% increase in EBIDTA in her tenure at the resort. She has been a cornerstone in the rebirth of a legendary Napa Valley Resort. She assisted with bringing the PGA back to the resort after a 30yr hiatus. She further pushed ROGR up 25% in the three years I worked with her. Connie is a tenacious sales person but whats more is her ability to mentor and lead large teams to achieve success and do so with great morale. I admire the heck out of her. ","Amy Leah Axelrod\n\n\n\nI had the great fortune to work with Connie as a task force director of catering and conventions at the Silverado Resort & Spa. With her formidable salesmanship, off-the charts creativity, and laser beam focus and persistence, Connie is one of the most impressive sales professionals I’ve had the pleasure to work with. \r\nConnie’s experience is only a part of what contributes to her success.  Her business acumen, particularly with revenue management, combined with her negotiation savvy have enabled her to identify the appropriate business for her property and then strategize to best accommodate the business to the hotel’s need periods.\r\nI especially appreciated her sense of humor in the midst of challenging situations! It was a privilege to work with her!\r\n","Keelin Czellecz Marcoux\n\n\n\nConnie Hagston is a pleasure to work with! She is professional, personable, always gets the job done and is very results oriented. She is a natural leader and would be an invaluable asset to any team.","Cheryl Nemazie\n\n\n\nI worked with Connie on two intensive projects, each involving tens of thousands of dollars. Success of the projects depended on her ability to mobilize managers and key personnel throughout the hotel, and enlist their support and cooperation. Her detailed communications clearly outlined the direction and needs required from each department. Both projects proceeded smoothly, with successful conclusions. Thanks to Connie's leadership, the staff remained enthusiastic and supportive throughout the process. Collaborating with her again would be an honor and a pleasure."],"activities":[],"similarly_named_profiles":[{"name":"Connie Hagston","link":"https://www.linkedin.com/in/connie-hagston-2502b946","summary":"Director of Sales and Marketing at Silverado Resort and Spa","location":"Napa, CA"}],"articles":[],"groups":[],"skills":[],"inferred_salary":null,"gender":null,"birth_date":null,"industry":null,"extra":null,"interests":[],"personal_emails":[],"personal_numbers":[]}